import { Typography, Divider, Stack, Box } from '@mui/material';
import './AboutPage.css';

function AboutPage() {
    const aboutInfo = "Είμαστε ο κορυφαίος πάροχος κινηματογραφικών εισιτηρίων, προσφέροντας έναν άνετο και ασφαλή τρόπο αγοράς εισιτηρίων για τις πιο πρόσφατες ταινίες. Ο ιστότοπός μας έχει σχεδιαστεί για να σας διευκολύνει να βρείτε τις ταινίες που θέλετε να δείτε και τις ώρες προβολής που σας εξυπηρετούν.\n\nΑπλά αναζητήστε την ταινία και την τοποθεσία που προτιμάτε και θα σας παρουσιαστεί μια λίστα με τις διαθέσιμες ώρες προβολής και τις τιμές των εισιτηρίων.Στη συνέχεια, μπορείτε να επιλέξετε τον αριθμό των εισιτηρίων που θέλετε να αγοράσετε και να προχωρήσετε στο ταμείο. Δεχόμαστε διάφορους τρόπους πληρωμής, συμπεριλαμβανομένων πιστωτικών και χρεωστικών καρτών, και προσφέρουμε ειδικές εκπτώσεις και προσφορές στα μέλη μας. Μπορείτε επίσης να επιλέξετε να σας αποσταλούν τα εισιτήριά σας στο email ή στο κινητό σας τηλέφωνο ή να τα παραλάβετε από το θέατρο. Δεσμευόμαστε να παρέχουμε την καλύτερη δυνατή εμπειρία για τους πελάτες μας.\n\nΕάν έχετε οποιεσδήποτε ερωτήσεις ή χρειάζεστε βοήθεια, η ομάδα εξυπηρέτησης πελατών μας είναι εδώ για να σας βοηθήσει. Σας ευχαριστούμε που επιλέξατε να κλείσετε τα εισιτήρια του κινηματογράφου σας μαζί μας. Ανυπομονούμε να σας δούμε στον κινηματογράφο!"

    return (
        <Box style={{ width: '100%', height: '100%' }} className='container'>
            <Stack direction={'column'}>
                <Typography sx={{ marginTop: 2, fontSize: 'x-large', marginLeft: 2, fontWeight: 'bolder' }}>ΣΧΕΤΙΚΑ ΜΕ ΕΜΑΣ</Typography>
                <Divider variant="middle" style={{ marginBottom: 10, marginTop: 10 }} />
                <Typography sx={{ whiteSpace: 'pre-wrap', fontSize: 'medium', marginLeft: 2 }}>{aboutInfo}</Typography>

            </Stack>
        </Box>
    );
}

export default AboutPage;
